---
kind: type
id: T:Autodesk.Revit.DB.Structure.TranslationRotationValue
source: html/0b6cf7fa-b211-2f21-98a0-4f4e0fe2ca0e.htm
---
# Autodesk.Revit.DB.Structure.TranslationRotationValue

Specifies the type of condition applied to the translation or rotation parameter.

## Syntax (C#)
```csharp
public enum TranslationRotationValue
```